//=================================================================================================
//
// GameObject ソースファイル
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "GameObject.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	GameObject::GameObject ()
		: m_valid ( true ), m_indexTexture ( 0 )
	{
	}

	GameObject::GameObject ( const GameObject& rhs )
	{
		m_matrix = rhs.m_matrix;
		m_valid = rhs.m_valid;
		m_indexTexture = rhs.m_indexTexture;
		m_fade = rhs.m_fade;
	}

	GameObject::~GameObject ()
	{
	}

	void GameObject::PreMove ()
	{
		m_fade.PreMove ();
	}

	void GameObject::Move ()
	{
		m_matrix.Move ();
	}

}	//namespace GAME

