//=================================================================================================
//
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Format.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	TOSS Format::m_toss;

	unique_ptr < TCHAR[] > Format::DebugOutf ( LPCTSTR format, ... )
	{
		va_list args;	//可変長リスト
		va_start ( args, format );	//文字列の先頭ポインタをセット

		//UNICODE、マルチバイト汎用関数(t~)を用いるのに　<tchar.h>のインクルードが必要
		int size = _vsctprintf ( format, args ) + 1;		//'\0'を最後につけたサイズを得る
		unique_ptr < TCHAR[] > buf = make_unique < TCHAR[] > ( size );		//バッファを確保
		_vstprintf_s ( buf.get (), size, format, args );	//バッファに書き込み

		va_end ( args );	//可変長リストの解放

		return move ( buf );
	}

}	//namespace GAME

