//=================================================================================================
//
// IOCharaDefine ヘッダファイル
//		共通定義
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Game.h"
#include "../Chara.h"

//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//=================================
	//ファイル形式のバージョン
	enum { CHARA_VERSION = 105 };
	//=================================

	//#########################################################################
	//##
	//##	◆キャラ .datファイル形式 ver105
	//##
	//##	File
	//##	┣━ ┓
	//##	┃	┣[uint] version
	//##	┃	┣[uint] スクリプト部のサイズ
	//##	┃	<Document>
	//##	┃	┣<イメージリスト "個数">
	//##	┃	┃	┗[]<イメージ "名前">
	//##	┃	┣<アクションリスト "個数">
	//##	┃	┃	┗[]<アクション "名前" "次アクション" "バランス" "アクション属性">
	//##	┃	┃		┗[]<スクリプト>
	//##	┃	┣<コマンドリスト "個数">
	//##	┃	┃	┗[]<コマンド "名前" "制限時間">
	//##	┃	┃		┗<キー "個数">
	//##	┃	┃			┗[]<キー "否定" "方向" "釦0" "釦1" "釦2" "釦3">
	//##	┃	┣<基本状態アクションID>
	//##	┃	┃	┗[]<立ち>, <構え>, <打合>, <避け>, <よろけ>, <ダメージ>, <ダウン>, <勝利>
	//##	┃	┃
	//##	┃	┣<Efイメージリスト "個数">
	//##	┃	┃	┗[]<イメージ "名前">
	//##	┃	┣<Ef "個数">
	//##	┃	┃	┗[]<Ef "名前" "同期">
	//##	┃	┃		┗[]<スクリプト>
	//##	┃
	//##	┣ImageList
	//##	┃	┗([uint]サイズ + [byte[]].png形式) * n
	//##	┃
	//##	┗EfImageList
	//##		┗([uint]サイズ + [byte[]].png形式) * n
	//##
	//##
	//##new	<スクリプト "フレーム数" "イメージID" "イメージ" "X" "Y" "VX" "VY" "AX" "AY" "計算状態" "攻撃値">
	//##		┣<ブランチ "個数">
	//##		┃	┗[]<ブランチ "コマンドID" "アクションID">
	//##		┣<EFジェネレート "個数">
	//##		┃	┗[]<EFジェネレート "エフェクトID "EF名" "生成位置X" "生成位置Y" "Z位置" "位置同期" >
	//##		┣<接触枠 "個数">
	//##		┃	┗[]<接触枠	"X" "Y" "W" "H">
	//##		┣<攻撃枠 "個数">
	//##		┃	┗[]<攻撃枠		"X" "Y" "W" "H">
	//##		┣<当り枠 "個数">
	//##		┃	┗[]<当り枠		"X" "Y" "W" "H">
	//##		┗<相殺枠 "個数">
	//##			┗[]<相殺枠		"X" "Y" "W" "H">
	//##
	//##
	//#########################################################################

	//-------------------------------------------
	//Document(ルート)下のエレメント
	enum ROOT_EL
	{
		EL_MAIN_IMAGE_LIST	,
		EL_EF_IMAGE_LIST	,
		EL_ACTION			,
		EL_COMMAND			,
		EL_BASIC_ACTION		,
		EL_EFFECT			,
	};

	//-------------------------------------------
	//アクション下のアトリビュート
	enum ATTR_ACTION
	{
		ATTR_ACTION_NAME		, 
		ATTR_ACTION_NEXT		, 
		ATTR_ACTION_BALANCE		, 
		ATTR_ACTION_CATEGORY	, 
	};

	//-------------------------------------------
	//スクリプト下のアトリビュート
	enum ATTR_SCRIPT
	{
		ATTR_SCRIPT_IMAGE_ID	, 
		ATTR_SCRIPT_POS_X		, 
		ATTR_SCRIPT_POS_Y		, 
		ATTR_SCRIPT_VEL_X		, 
		ATTR_SCRIPT_VEL_Y		, 
		ATTR_SCRIPT_ACC_X		, 
		ATTR_SCRIPT_ACC_Y		, 
		ATTR_SCRIPT_CLCST		, 
		ATTR_SCRIPT_POWER		, 
	};

	//スクリプト下のエレメント
	enum
	{
		ELEM_SCRIPT_BRANCH, 
		ELEM_SCRIPT_EFGNRT, 
		ELEM_SCRIPT_CRECT, 
		ELEM_SCRIPT_ARECT, 
		ELEM_SCRIPT_HRECT, 
		ELEM_SCRIPT_ORECT, 
	};

	//ゲームキー下のエレメント
	enum
	{
		ELEM_GAMEKEY_NOT,
		ELEM_GAMEKEY_DIR,
		ELEM_GAMEKEY_BTN,	//以降GAME_KEY_BUTTON_NUMを加算
	};

	//コマンドのアトリビュート
	enum
	{
		ATTR_COMMAND_NAME,
		ATTR_COMMAND_LIMIT,
	};

	//ブランチのアトリビュート列挙
	enum
	{
		ATTR_BRANCH_COMMAND_INDEX, 
		ATTR_BRANCH_COMMAND_NAME, 
		ATTR_BRANCH_ACTION_INDEX, 
		ATTR_BRANCH_ACTION_NAME,
		ATTR_BRANCH_FRAME_INDEX,
	};


}	//namespace GAME


