//=================================================================================================
//
// Command ソースファイル
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Command.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{

	Command::Command () :
		m_name (_T("command name")), m_limitTime ( 0 )
	{
	}

	Command::~Command ()
	{
		m_vecGameKey.clear ();
	}

	bool Command::Compare ( const V_GAME_KEY & vecGameKey, bool dirRight )
	{
		//キー配列長さか、コマンド受付時間の短い方で検索
		UINT len = vecGameKey.size ();
		UINT frame = ( m_limitTime < len ) ? m_limitTime : len;
		
		//完成入力数（カウントダウン）(判定は-1まで用いる)
		int comp = m_vecGameKey.size() - 1;

		//フレームを遡って検索
		for ( UINT i = 0; i < frame; ++i )
		{
			if ( vecGameKey[i].Compare( m_vecGameKey[comp], dirRight ) )
			{
				--comp;
			}
			if ( 0 > comp ) { return true; }
		}
		return false;
	}


}	//namespace GAME

