//=================================================================================================
//
// HoldTimer 
//
//=================================================================================================

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "HoldTimer.h"

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	HoldTimer::HoldTimer ()
		: m_bStart ( F ), m_bHold ( F )
	{
	}

	HoldTimer::HoldTimer ( UINT targetTime )
		: Timer ( targetTime ), m_bStart ( F ), m_bHold ( F )
	{
	}

	HoldTimer::~HoldTimer ()
	{
	}

	void HoldTimer::Check ( bool b )
	{
		//条件を満たさない瞬間終了
		if ( ! b )
		{
			m_bStart = F;
			m_bHold = F;
			Reset ();
			return;
		}

		//以下、条件を満たす
		m_bStart = F;	//最初の1[F]のみTrue

		//押込中
		if ( m_bHold ) { return; }	//続行

		//計測終了後
		if ( IsLast () )
		{
			m_bHold = T;	//押込開始
			return;
		}

		//計測開始
		if ( ! IsActive () )
		{
			Start ();
			m_bStart = T;
		}

		//計測中は何もしない
	}

}	//namespace GAME

