//=================================================================================================
//
// DirectX内外で用いる定義
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイル インクルード
//-------------------------------------------------------------------------------------------------
#include "Directx_common.h"		//DirectX共通
#include <d3dx9math.h>

//-------------------------------------------------------------------------------------------------
// 定義
//-------------------------------------------------------------------------------------------------
namespace GAME 
{
//------------------------------------------
//定数
//------------------------------------------
#define		D3DX_PI_HALF    ( (FLOAT) 1.570796327f )	
#define		D3DX_2PI	    ( (FLOAT) 6.283185308f )	
#define		D3DX_PIBY6		( (FLOAT) 0.523598775f )

constexpr float Z_DEFALT = 0.5f;		//z位置基本

//------------------------------------------
//型指定
//------------------------------------------
//デバイス
using D3DDEV = LPDIRECT3DDEVICE9;

//テクスチャ
using TX = LPDIRECT3DTEXTURE9;

//頂点(バーテックス)バッファ
using VXBUF = LPDIRECT3DVERTEXBUFFER9;

//位置
using VEC2 = D3DXVECTOR2;
using P_VEC2 = std::shared_ptr < VEC2 >;
using V_VEC2 = std:: vector < VEC2 >;
using L_VEC2 = std:: list < VEC2 >;

using VEC3 = D3DXVECTOR3;
using P_VEC3 = std::shared_ptr < VEC3 >;
using V_VEC3 = std::vector < VEC3 >;
using L_VEC3 = std::list < VEC3 >;

//色
using _CLR = D3DXCOLOR;

//ミップマップレベル
enum
{
	MP_LV_1 = 1,
};


}	//namespace GAME

