//=================================================================================================
//
// ディスプレイの列挙と情報の取得
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダのインクルード
//-------------------------------------------------------------------------------------------------
#include "Define.h"
#include <windows.h>
#include "DebugLibrary.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME 
{
	class EnumDisplay
	{
		//HWND取得コールバック関数
		static BOOL CALLBACK EnumDisplayProc ( HMONITOR hMnt, HDC hdc, LPRECT lpRect, LPARAM dwParam );

	public:
		EnumDisplay () = delete;	//staticクラスなので実体化禁止
		EnumDisplay ( const EnumDisplay & rhs ) = delete;
		~EnumDisplay () = delete;

		//モニタ数を取得
		static int GetMonitorNum ();
	};

}	//namespace GAME

