//=================================================================================================
//
// HoldTimer 
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイルのインクルード
//-------------------------------------------------------------------------------------------------
#include "Timer.h"

//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	//======================================================
	//	カーソルなどに使う「押しっぱなしで連続入力」に用いるタイマ
	//	※初回１回のみ True,
	//	Wait時は False,
	//	Hold時は True,
	//	を返す
	//======================================================

	class HoldTimer : public Timer
	{
		bool	m_bWait;	//計測中
		bool	m_bHold;	//押込中

	public:
		HoldTimer ();
		HoldTimer ( UINT targetTime );	//目標時間
		HoldTimer ( const HoldTimer & rhs ) = delete;
		~HoldTimer ();

		//------------------------------------------------------------
		//引数	bool b : チェックする条件
		void Check ( bool b );	//Move()内などでキー入力状態などで毎フレーム計測する
		//
		// /*ex.*/	m_hold->Check ( IsKey ( Btn0 ) );
		//
		//------------------------------------------------------------

		bool IsHold () const { return m_bHold; }
	};

	using P_HoldTimer = shared_ptr < HoldTimer >;


}	//namespace GAME


