//=================================================================================================
//
//	文字列ユーティリティ
//
//=================================================================================================
#pragma once

//-------------------------------------------------------------------------------------------------
// ヘッダファイル　インクルード
//-------------------------------------------------------------------------------------------------
#include "Define.h"


//-------------------------------------------------------------------------------------------------
// 宣言
//-------------------------------------------------------------------------------------------------
namespace GAME
{
	class STR_UTL final
	{
	public:
		STR_UTL () = delete;	//staticクラスとして実体化禁止
		~STR_UTL () = delete;


		//文字列定数のサイズを返す
		static UINT Size ( LPCTSTR lpctstr );
		
		//文字コード取得
		static UINT GetCode ( PTCHAR ptch );
		static UINT GetCode ( LPCTCH lpctch );
		static UINT GetCode ( char ascii );

		//テクスチャ用
		//2のべき乗補完 ( 1 ～ 65536 )
		//範囲外は１
		static LONG PowerNormalize ( LONG ln );
	};


}	//namespace GAME

